In [ ]:
**Create data**

In [64]:
#import library
import pandas as pd
data = {
    'Имя': ['Аня', 'Борис', 'Катя', 'Максим', 'Оля'],
    'Возраст': [23, 25, 22, 24, 23],
    'Город': ['Москва', 'Питер', 'Казань', 'Москва', 'Самара'],
    'Оценка': [85, 90, 88, 92, 87]
}

df = pd.DataFrame(data)

In [66]:
print(df)

      Имя  Возраст   Город  Оценка
0     Аня       23  Москва      85
1   Борис       25   Питер      90
2    Катя       22  Казань      88
3  Максим       24  Москва      92
4     Оля       23  Самара      87

In [68]:
print(df.head())

      Имя  Возраст   Город  Оценка
0     Аня       23  Москва      85
1   Борис       25   Питер      90
2    Катя       22  Казань      88
3  Максим       24  Москва      92
4     Оля       23  Самара      87

In [70]:
print(df.info()) # give info about table

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Имя      5 non-null      object
 1   Возраст  5 non-null      int64
 2   Город    5 non-null      object
 3   Оценка   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None

In [76]:
avg_age = df['Возраст'].mean() # average age
print(f"Средний возраст: {avg_age}")

Средний возраст: 23.4

In [78]:
avg_grade = df['Оценка'].mean() #average grade
print(f"Средняя оценка: {avg_grade}")

Средняя оценка: 88.4

In [80]:
#add new column
df['Пол'] = ['Ж', 'М', 'Ж', 'М', 'Ж']

In [82]:
print(df)

      Имя  Возраст   Город  Оценка Пол
0     Аня       23  Москва      85   Ж
1   Борис       25   Питер      90   М
2    Катя       22  Казань      88   Ж
3  Максим       24  Москва      92   М
4     Оля       23  Самара      87   Ж

In [91]:
#ex1
new_data = {
    'Имя' : ['Анна', 'Борис', 'Виктор', 'Галина'],
    'Возраст' : [21, 22, 20, 23],
    'Факультет' : ['Физика', 'Математика', 'Информатика', 'Математика']
}
df1 = pd.DataFrame(new_data)
print(df1)

      Имя  Возраст    Факультет
0    Анна       21       Физика
1   Борис       22   Математика
2  Виктор       20  Информатика
3  Галина       23   Математика

In [93]:
#ex2
names = df1['Имя']
print(names)

0      Анна
1     Борис
2    Виктор
3    Галина
Name: Имя, dtype: object

In [95]:
#ex3 add
df1["Средний балл"] = [85, 90, 78, 88]
print(df1)

      Имя  Возраст    Факультет  Средний балл
0    Анна       21       Физика            85
1   Борис       22   Математика            90
2  Виктор       20  Информатика            78
3  Галина       23   Математика            88

In [97]:
df1 = df1.drop(columns='Факультет')
print(df1)

      Имя  Возраст  Средний балл
0    Анна       21            85
1   Борис       22            90
2  Виктор       20            78
3  Галина       23            88

In [100]:
#Use new library seaborn to play with some datasets like titanic
import seaborn as sns
titanic_df = sns.load_dataset('titanic')
print(titanic_df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

**Output passanger /first class/**

In [104]:
first_class_passanger = titanic_df[titanic_df['class'] == 'First']
print(first_class_passanger)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1           1       1  female  38.0      1      0  71.2833        C  First
3           1       1  female  35.0      1      0  53.1000        S  First
6           0       1    male  54.0      0      0  51.8625        S  First
11          1       1  female  58.0      0      0  26.5500        S  First
23          1       1    male  28.0      0      0  35.5000        S  First
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
871         1       1  female  47.0      1      1  52.5542        S  First
872         0       1    male  33.0      0      0   5.0000        S  First
879         1       1  female  56.0      0      1  83.1583        C  First
887         1       1  female  19.0      0      0  30.0000        S  First
889         1       1    male  26.0      0      0  30.0000        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
11   woman       False    C  Southampton   yes   True
23     man        True    A  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[216 rows x 15 columns]

**info**

In [108]:
print(titanic_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [110]:
print(titanic_df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [112]:
avg_titanic = titanic_df['age'].mean()
print(f"Average age: {avg_titanic}")

Average age: 29.69911764705882

In [114]:
avg_survived = titanic_df['survived'].mean()

In [116]:
print(avg_survived)

0.3838383838383838